VU-Civic/firmware-ai/FSBL/Core/Startup/startup_stm32n647l0hxq_fsbl.s
.weak	UsageFault_Handler
.thumb_set UsageFault_Handler,Default_Handler

.weak	SecureFault_Handler
.thumb_set SecureFault_Handler,Default_Handler

.weak	SVC_Handler
.thumb_set SVC_Handler,Default_Handler

.weak	DebugMon_Handler
.thumb_set DebugMon_Handler,Default_Handler

.weak	PendSV_Handler
.thumb_set PendSV_Handler,Default_Handler

.weak	SysTick_Handler
.thumb_set SysTick_Handler,Default_Handler

.weak	PVD_PVM_IRQHandler
.thumb_set PVD_PVM_IRQHandler,Default_Handler

.weak	DTS_IRQHandler
.thumb_set DTS_IRQHandler,Default_Handler

.weak	RCC_IRQHandler
.thumb_set RCC_IRQHandler,Default_Handler

.weak	LOCKUP_IRQHandler
.thumb_set LOCKUP_IRQHandler,Default_Handler

.weak	CACHE_ECC_IRQHandler
.thumb_set CACHE_ECC_IRQHandler,Default_Handler

.weak	TCM_ECC_IRQHandler
.thumb_set TCM_ECC_IRQHandler,Default_Handler

.weak	BCK_ECC_IRQHandler
.thumb_set BCK_ECC_IRQHandler,Default_Handler

.weak	FPU_IRQHandler
.thumb_set FPU_IRQHandler,Default_Handler

.weak	RTC_S_IRQHandler
.thumb_set RTC_S_IRQHandler,Default_Handler

.weak	TAMP_IRQHandler
.thumb_set TAMP_IRQHandler,Default_Handler

.weak	RIFSC_TAMPER_IRQHandler
.thumb_set RIFSC_TAMPER_IRQHandler,Default_Handler

.weak	IAC_IRQHandler
.thumb_set IAC_IRQHandler,Default_Handler

.weak	RCC_S_IRQHandler
.thumb_set RCC_S_IRQHandler,Default_Handler

.weak	RTC_IRQHandler
.thumb_set RTC_IRQHandler,Default_Handler

.weak	IWDG_IRQHandler
.thumb_set IWDG_IRQHandler,Default_Handler

.weak	WWDG_IRQHandler
.thumb_set WWDG_IRQHandler,Default_Handler

.weak	EXTI0_IRQHandler
.thumb_set EXTI0_IRQHandler,Default_Handler

.weak	EXTI1_IRQHandler
.thumb_set EXTI1_IRQHandler,Default_Handler

.weak	EXTI2_IRQHandler
.thumb_set EXTI2_IRQHandler,Default_Handler

.weak	EXTI3_IRQHandler
.thumb_set EXTI3_IRQHandler,Default_Handler

.weak	EXTI4_IRQHandler
.thumb_set EXTI4_IRQHandler,Default_Handler

.weak	EXTI5_IRQHandler
.thumb_set EXTI5_IRQHandler,Default_Handler

.weak	EXTI6_IRQHandler
.thumb_set EXTI6_IRQHandler,Default_Handler

.weak	EXTI7_IRQHandler
.thumb_set EXTI7_IRQHandler,Default_Handler

.weak	EXTI8_IRQHandler
.thumb_set EXTI8_IRQHandler,Default_Handler

.weak	EXTI9_IRQHandler
.thumb_set EXTI9_IRQHandler,Default_Handler

.weak	EXTI10_IRQHandler
.thumb_set EXTI10_IRQHandler,Default_Handler

.weak	EXTI11_IRQHandler
.thumb_set EXTI11_IRQHandler,Default_Handler

.weak	EXTI12_IRQHandler
.thumb_set EXTI12_IRQHandler,Default_Handler

.weak	EXTI13_IRQHandler
.thumb_set EXTI13_IRQHandler,Default_Handler

.weak	EXTI14_IRQHandler
.thumb_set EXTI14_IRQHandler,Default_Handler

.weak	EXTI15_IRQHandler
.thumb_set EXTI15_IRQHandler,Default_Handler

.weak	PKA_IRQHandler
.thumb_set PKA_IRQHandler,Default_Handler

.weak	HASH_IRQHandler
.thumb_set HASH_IRQHandler,Default_Handler

.weak	RNG_IRQHandler
.thumb_set RNG_IRQHandler,Default_Handler

.weak	ADC1_2_IRQHandler
.thumb_set ADC1_2_IRQHandler,Default_Handler

.weak	CSI_IRQHandler
.thumb_set CSI_IRQHandler,Default_Handler

.weak	DCMIPP_IRQHandler
.thumb_set DCMIPP_IRQHandler,Default_Handler

.weak	PAHB_ERR_IRQHandler
.thumb_set PAHB_ERR_IRQHandler,Default_Handler

.weak	NPU0_IRQHandler
.thumb_set NPU0_IRQHandler,Default_Handler

.weak	NPU1_IRQHandler
.thumb_set NPU1_IRQHandler,Default_Handler

.weak	NPU2_IRQHandler
.thumb_set NPU2_IRQHandler,Default_Handler

.weak	NPU3_IRQHandler
.thumb_set NPU3_IRQHandler,Default_Handler

.weak	CACHEAXI_IRQHandler
.thumb_set CACHEAXI_IRQHandler,Default_Handler

.weak	LTDC_LO_IRQHandler
.thumb_set LTDC_LO_IRQHandler,Default_Handler

.weak	LTDC_LO_ERR_IRQHandler
.thumb_set LTDC_LO_ERR_IRQHandler,Default_Handler

.weak	DMA2D_IRQHandler
.thumb_set DMA2D_IRQHandler,Default_Handler

.weak	JPEG_IRQHandler
.thumb_set JPEG_IRQHandler,Default_Handler

.weak	VENC_IRQHandler
.thumb_set VENC_IRQHandler,Default_Handler

.weak	GFXMMU_IRQHandler
.thumb_set GFXMMU_IRQHandler,Default_Handler

.weak	GFXTIM_IRQHandler
.thumb_set GFXTIM_IRQHandler,Default_Handler

.weak	GPU2D_IRQHandler
.thumb_set GPU2D_IRQHandler,Default_Handler

.weak	GPU2D_ER_IRQHandler
.thumb_set GPU2D_ER_IRQHandler,Default_Handler

.weak	ICACHE_IRQHandler
.thumb_set ICACHE_IRQHandler,Default_Handler

.weak	HPDMA1_Channel0_IRQHandler
.thumb_set HPDMA1_Channel0_IRQHandler,Default_Handler

.weak	HPDMA1_Channel1_IRQHandler
.thumb_set HPDMA1_Channel1_IRQHandler,Default_Handler

.weak	HPDMA1_Channel2_IRQHandler
.thumb_set HPDMA1_Channel2_IRQHandler,Default_Handler

.weak	HPDMA1_Channel3_IRQHandler
.thumb_set HPDMA1_Channel3_IRQHandler,Default_Handler

.weak	HPDMA1_Channel4_IRQHandler
.thumb_set HPDMA1_Channel4_IRQHandler,Default_Handler

.weak	HPDMA1_Channel5_IRQHandler
.thumb_set HPDMA1_Channel5_IRQHandler,Default_Handler

.weak	HPDMA1_Channel6_IRQHandler
.thumb_set HPDMA1_Channel6_IRQHandler,Default_Handler

.weak	HPDMA1_Channel7_IRQHandler
.thumb_set HPDMA1_Channel7_IRQHandler,Default_Handler

.weak	HPDMA1_Channel8_IRQHandler
.thumb_set HPDMA1_Channel8_IRQHandler,Default_Handler

.weak	HPDMA1_Channel9_IRQHandler
.thumb_set HPDMA1_Channel9_IRQHandler,Default_Handler

.weak	HPDMA1_Channel10_IRQHandler
.thumb_set HPDMA1_Channel10_IRQHandler,Default_Handler

.weak	HPDMA1_Channel11_IRQHandler
.thumb_set HPDMA1_Channel11_IRQHandler,Default_Handler

.weak	HPDMA1_Channel12_IRQHandler
.thumb_set HPDMA1_Channel12_IRQHandler,Default_Handler

.weak	HPDMA1_Channel13_IRQHandler
.thumb_set HPDMA1_Channel13_IRQHandler,Default_Handler

.weak	HPDMA1_Channel14_IRQHandler
.thumb_set HPDMA1_Channel14_IRQHandler,Default_Handler

.weak	HPDMA1_Channel15_IRQHandler
.thumb_set HPDMA1_Channel15_IRQHandler,Default_Handler

.weak	GPDMA1_Channel0_IRQHandler
.thumb_set GPDMA1_Channel0_IRQHandler,Default_Handler

.weak	GPDMA1_Channel1_IRQHandler
.thumb_set GPDMA1_Channel1_IRQHandler,Default_Handler

.weak	GPDMA1_Channel2_IRQHandler
.thumb_set GPDMA1_Channel2_IRQHandler,Default_Handler

.weak	GPDMA1_Channel3_IRQHandler
.thumb_set GPDMA1_Channel3_IRQHandler,Default_Handler

.weak	GPDMA1_Channel4_IRQHandler
.thumb_set GPDMA1_Channel4_IRQHandler,Default_Handler

.weak	GPDMA1_Channel5_IRQHandler
.thumb_set GPDMA1_Channel5_IRQHandler,Default_Handler

.weak	GPDMA1_Channel6_IRQHandler
.thumb_set GPDMA1_Channel6_IRQHandler,Default_Handler

