VU-Civic/firmware-ai/FSBL/Core/Startup/startup_stm32n647l0hxq_fsbl.s
.weak	GPDMA1_Channel7_IRQHandler
.thumb_set GPDMA1_Channel7_IRQHandler,Default_Handler

.weak	GPDMA1_Channel8_IRQHandler
.thumb_set GPDMA1_Channel8_IRQHandler,Default_Handler

.weak	GPDMA1_Channel9_IRQHandler
.thumb_set GPDMA1_Channel9_IRQHandler,Default_Handler

.weak	GPDMA1_Channel10_IRQHandler
.thumb_set GPDMA1_Channel10_IRQHandler,Default_Handler

.weak	GPDMA1_Channel11_IRQHandler
.thumb_set GPDMA1_Channel11_IRQHandler,Default_Handler

.weak	GPDMA1_Channel12_IRQHandler
.thumb_set GPDMA1_Channel12_IRQHandler,Default_Handler

.weak	GPDMA1_Channel13_IRQHandler
.thumb_set GPDMA1_Channel13_IRQHandler,Default_Handler

.weak	GPDMA1_Channel14_IRQHandler
.thumb_set GPDMA1_Channel14_IRQHandler,Default_Handler

.weak	GPDMA1_Channel15_IRQHandler
.thumb_set GPDMA1_Channel15_IRQHandler,Default_Handler

.weak	I2C1_EV_IRQHandler
.thumb_set I2C1_EV_IRQHandler,Default_Handler

.weak	I2C1_ER_IRQHandler
.thumb_set I2C1_ER_IRQHandler,Default_Handler

.weak	I2C2_EV_IRQHandler
.thumb_set I2C2_EV_IRQHandler,Default_Handler

.weak	I2C2_ER_IRQHandler
.thumb_set I2C2_ER_IRQHandler,Default_Handler

.weak	I2C3_EV_IRQHandler
.thumb_set I2C3_EV_IRQHandler,Default_Handler

.weak	I2C3_ER_IRQHandler
.thumb_set I2C3_ER_IRQHandler,Default_Handler

.weak	I2C4_EV_IRQHandler
.thumb_set I2C4_EV_IRQHandler,Default_Handler

.weak	I2C4_ER_IRQHandler
.thumb_set I2C4_ER_IRQHandler,Default_Handler

.weak	I3C1_EV_IRQHandler
.thumb_set I3C1_EV_IRQHandler,Default_Handler

.weak	I3C1_ER_IRQHandler
.thumb_set I3C1_ER_IRQHandler,Default_Handler

.weak	I3C2_EV_IRQHandler
.thumb_set I3C2_EV_IRQHandler,Default_Handler

.weak	I3C2_ER_IRQHandler
.thumb_set I3C2_ER_IRQHandler,Default_Handler

.weak	TIM1_BRK_IRQHandler
.thumb_set TIM1_BRK_IRQHandler,Default_Handler

.weak	TIM1_UP_IRQHandler
.thumb_set TIM1_UP_IRQHandler,Default_Handler

.weak	TIM1_TRG_CCU_IRQHandler
.thumb_set TIM1_TRG_CCU_IRQHandler,Default_Handler

.weak	TIM1_CC_IRQHandler
.thumb_set TIM1_CC_IRQHandler,Default_Handler

.weak	TIM2_IRQHandler
.thumb_set TIM2_IRQHandler,Default_Handler

.weak	TIM3_IRQHandler
.thumb_set TIM3_IRQHandler,Default_Handler

.weak	TIM4_IRQHandler
.thumb_set TIM4_IRQHandler,Default_Handler

.weak	TIM5_IRQHandler
.thumb_set TIM5_IRQHandler,Default_Handler

.weak	TIM6_IRQHandler
.thumb_set TIM6_IRQHandler,Default_Handler

.weak	TIM7_IRQHandler
.thumb_set TIM7_IRQHandler,Default_Handler

.weak	TIM8_BRK_IRQHandler
.thumb_set TIM8_BRK_IRQHandler,Default_Handler

.weak	TIM8_UP_IRQHandler
.thumb_set TIM8_UP_IRQHandler,Default_Handler

.weak	TIM8_TRG_CCU_IRQHandler
.thumb_set TIM8_TRG_CCU_IRQHandler,Default_Handler

.weak	TIM8_CC_IRQHandler
.thumb_set TIM8_CC_IRQHandler,Default_Handler

.weak	TIM9_IRQHandler
.thumb_set TIM9_IRQHandler,Default_Handler

.weak	TIM10_IRQHandler
.thumb_set TIM10_IRQHandler,Default_Handler

.weak	TIM11_IRQHandler
.thumb_set TIM11_IRQHandler,Default_Handler

.weak	TIM12_IRQHandler
.thumb_set TIM12_IRQHandler,Default_Handler

.weak	TIM13_IRQHandler
.thumb_set TIM13_IRQHandler,Default_Handler

.weak	TIM14_IRQHandler
.thumb_set TIM14_IRQHandler,Default_Handler

.weak	TIM15_IRQHandler
.thumb_set TIM15_IRQHandler,Default_Handler

.weak	TIM16_IRQHandler
.thumb_set TIM16_IRQHandler,Default_Handler

.weak	TIM17_IRQHandler
.thumb_set TIM17_IRQHandler,Default_Handler

.weak	TIM18_IRQHandler
.thumb_set TIM18_IRQHandler,Default_Handler

.weak	LPTIM1_IRQHandler
.thumb_set LPTIM1_IRQHandler,Default_Handler

.weak	LPTIM2_IRQHandler
.thumb_set LPTIM2_IRQHandler,Default_Handler

.weak	LPTIM3_IRQHandler
.thumb_set LPTIM3_IRQHandler,Default_Handler

.weak	LPTIM4_IRQHandler
.thumb_set LPTIM4_IRQHandler,Default_Handler

.weak	LPTIM5_IRQHandler
.thumb_set LPTIM5_IRQHandler,Default_Handler

.weak	ADF1_FLT0_IRQHandler
.thumb_set ADF1_FLT0_IRQHandler,Default_Handler

.weak	MDF1_FLT0_IRQHandler
.thumb_set MDF1_FLT0_IRQHandler,Default_Handler

.weak	MDF1_FLT1_IRQHandler
.thumb_set MDF1_FLT1_IRQHandler,Default_Handler

.weak	MDF1_FLT2_IRQHandler
.thumb_set MDF1_FLT2_IRQHandler,Default_Handler

.weak	MDF1_FLT3_IRQHandler
.thumb_set MDF1_FLT3_IRQHandler,Default_Handler

.weak	MDF1_FLT4_IRQHandler
.thumb_set MDF1_FLT4_IRQHandler,Default_Handler

.weak	MDF1_FLT5_IRQHandler
.thumb_set MDF1_FLT5_IRQHandler,Default_Handler

.weak	SAI1_A_IRQHandler
.thumb_set SAI1_A_IRQHandler,Default_Handler

.weak	SAI1_B_IRQHandler
.thumb_set SAI1_B_IRQHandler,Default_Handler

.weak	SAI2_A_IRQHandler
.thumb_set SAI2_A_IRQHandler,Default_Handler

.weak	SAI2_B_IRQHandler
.thumb_set SAI2_B_IRQHandler,Default_Handler

.weak	SPDIFRX_IRQHandler
.thumb_set SPDIFRX_IRQHandler,Default_Handler

.weak	SPI1_IRQHandler
.thumb_set SPI1_IRQHandler,Default_Handler

.weak	SPI2_IRQHandler
.thumb_set SPI2_IRQHandler,Default_Handler

.weak	SPI3_IRQHandler
.thumb_set SPI3_IRQHandler,Default_Handler

.weak	SPI4_IRQHandler
.thumb_set SPI4_IRQHandler,Default_Handler

.weak	SPI5_IRQHandler
.thumb_set SPI5_IRQHandler,Default_Handler

.weak	SPI6_IRQHandler
.thumb_set SPI6_IRQHandler,Default_Handler

.weak	USART1_IRQHandler
.thumb_set USART1_IRQHandler,Default_Handler

.weak	USART2_IRQHandler
.thumb_set USART2_IRQHandler,Default_Handler

.weak	USART3_IRQHandler
.thumb_set USART3_IRQHandler,Default_Handler

.weak	UART4_IRQHandler
.thumb_set UART4_IRQHandler,Default_Handler

.weak	UART5_IRQHandler
.thumb_set UART5_IRQHandler,Default_Handler

.weak	USART6_IRQHandler
.thumb_set USART6_IRQHandler,Default_Handler

.weak	UART7_IRQHandler
.thumb_set UART7_IRQHandler,Default_Handler

.weak	UART8_IRQHandler
.thumb_set UART8_IRQHandler,Default_Handler

.weak	UART9_IRQHandler
.thumb_set UART9_IRQHandler,Default_Handler

.weak	USART10_IRQHandler
.thumb_set USART10_IRQHandler,Default_Handler

.weak	LPUART1_IRQHandler
.thumb_set LPUART1_IRQHandler,Default_Handler

.weak	XSPI1_IRQHandler
.thumb_set XSPI1_IRQHandler,Default_Handler

.weak	XSPI2_IRQHandler
.thumb_set XSPI2_IRQHandler,Default_Handler

.weak	XSPI3_IRQHandler
.thumb_set XSPI3_IRQHandler,Default_Handler

.weak	FMC_IRQHandler
.thumb_set FMC_IRQHandler,Default_Handler

.weak	SDMMC1_IRQHandler
.thumb_set SDMMC1_IRQHandler,Default_Handler

.weak	SDMMC2_IRQHandler
.thumb_set SDMMC2_IRQHandler,Default_Handler

.weak	UCPD1_IRQHandler
.thumb_set UCPD1_IRQHandler,Default_Handler

.weak	USB1_OTG_HS_IRQHandler
.thumb_set USB1_OTG_HS_IRQHandler,Default_Handler

.weak	USB2_OTG_HS_IRQHandler
.thumb_set USB2_OTG_HS_IRQHandler,Default_Handler

.weak	ETH1_IRQHandler
.thumb_set ETH1_IRQHandler,Default_Handler

.weak	FDCAN1_IT0_IRQHandler
.thumb_set FDCAN1_IT0_IRQHandler,Default_Handler

.weak	FDCAN1_IT1_IRQHandler
.thumb_set FDCAN1_IT1_IRQHandler,Default_Handler

.weak	FDCAN2_IT0_IRQHandler
.thumb_set FDCAN2_IT0_IRQHandler,Default_Handler

.weak	FDCAN2_IT1_IRQHandler
.thumb_set FDCAN2_IT1_IRQHandler,Default_Handler

.weak	FDCAN3_IT0_IRQHandler
.thumb_set FDCAN3_IT0_IRQHandler,Default_Handler

.weak	FDCAN3_IT1_IRQHandler
.thumb_set FDCAN3_IT1_IRQHandler,Default_Handler

.weak	FDCAN_CU_IRQHandler
.thumb_set FDCAN_CU_IRQHandler,Default_Handler

.weak	MDIOS_IRQHandler
.thumb_set MDIOS_IRQHandler,Default_Handler

.weak	DCMI_PSSI_IRQHandler
.thumb_set DCMI_PSSI_IRQHandler,Default_Handler

.weak	WAKEUP_PIN_IRQHandler
.thumb_set WAKEUP_PIN_IRQHandler,Default_Handler

.weak	CTI_INT0_IRQHandler
.thumb_set CTI_INT0_IRQHandler,Default_Handler

.weak	CTI_INT1_IRQHandler
.thumb_set CTI_INT1_IRQHandler,Default_Handler

.weak	LTDC_UP_IRQHandler
.thumb_set LTDC_UP_IRQHandler,Default_Handler

.weak	LTDC_UP_ERR_IRQHandler
.thumb_set LTDC_UP_ERR_IRQHandler,Default_Handler

.weak	SystemInit
